{
  "shipDeploymentRoles": {
    "firstMate": {
      "feats": [
        {
          "rank": 1,
          "name": "Steady Resolve",
          "description": "When the ship fails a Strength, Dexterity, or Constitution saving throw, as a reaction, you can use your reaction and expend a command die to attempt to recover. Roll the die and add the result to the saving throw."
        },
        {
          "rank": 2,
          "name": "Targeted Broadside",
          "description": "As an action, you can make a DC 15 Dexterity (Water Vehicles) check to position your ship for maximum firing advantage. On a success, all ranged weapon attacks made by your ship against a single enemy vessel gain advantage until the beginning of your next turn. This precise maneuver requires expert timing, limiting the ship’s movement to half its speed during the current round. You may use this feature a number of times equal to your proficiency bonus, regaining all expended uses after a long rest."
        },
        {
          "rank": 3,
          "name": "Ramming Speed",
          "description": "When you take the Ram action, you can expend a command die to increase the damage. On a failed save, the target ship takes additional bludgeoning damage equal to the amount rolled on the die + your ship’s Strength modifier. Your ship is unaffected by the additional damage dealt by this tactic."
        },
        {
          "rank": 4,
          "name": "Evasive Maneuvers",
          "description": "Your instinctive control of the helm lets you dodge out of the way of certain area effects. When your ship is subjected to an effect that allows your ship to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on a saving throw, and only half damage if it fails."
        },
        {
          "rank": 5,
          "name": "Expert Helmsman",
          "description": "When you would expend a command die, you can use a d4 instead of expending the die. You can only use this feature once per round."
        }
      ]
    },
    "commsOfficer": {
      "feats": [
        {
          "rank": 1,
          "name": "All Hands on Deck!",
          "description": "If you are surprised at the start of combat and are not incapacitated, you can make a DC15 Charisma saving throw to mitigate enemy surprise. If you are not surprised, you can expend a command die and add the number rolled to the initiative of your ship."
        },
        {
          "rank": 2,
          "name": "Look Alive!",
          "description": "As an action, you can expend one command die to bolster the resolve of the crew of your or another allied ship. That ship gains temporary hit points equal to the command die roll + your Charisma modifier."
        },
        {
          "rank": 3,
          "name": "Brace for Impact!",
          "description": "When a friendly ship, including your own, who can see or hear you makes a saving throw, you can use your reaction and expend a command die, adding the number rolled to the result of the saving throw. You can use this feature before or after making the saving throw, but before any effects of the saving throw are determined."
        },
        {
          "rank": 4,
          "name": "Have at Ye!",
          "description": "As an action, you can expend one command die to bolster the resolve of a crew on your or another allied ship who can see or hear you. The targeted ship can add your Charisma modifier to a number of damage rolls they make until the start of your next turn equal to the number rolled on the die."
        },
        {
          "rank": 5,
          "name": "Cover Us!",
          "description": "When a ship makes an attack roll against your ship, you can use your reaction and expend a command die and command another willing ally ship within 300 feet of the enemy ship to intercede. A crewmember on that allied ship manning a weapon station must use their reaction to do so. The enemy ship is then forced to make an attack on the ally ship instead. If the attack misses, the crewmember can immediately make a weapon attack against the enemy ship as a part of that same reaction. Roll the command die, and add the result to the ally’s attack roll."
        }
      ]
    },
    "boatswain": {
      "feats": [
        {
          "rank": 1,
          "name": "Reinforced Repair",
          "description": "As a bonus action, you can expend one command die to use a hull die and recover Hull Points. You gain additional Hull Points equal to the amount rolled on the command die."
        },
        {
          "rank": 2,
          "name": "Rapid Repairman",
          "description": "When you take the Patch action, you may choose to do so with disadvantage. If you succeed on the check, you can expend 2 Hull Dice, instead of one. For each Hull Die spent in this way, roll the die and add the ship’s Constitution modifier to it."
        },
        {
          "rank": 3,
          "name": "Damage Control",
          "description": "When your ship would make a Saving throw, you can take take the maximum instead of rolling. You can use this feature before or after making the roll, but before any effects of the roll are determined. You may use this feature once before completing a short or long rest."
        },
        {
          "rank": 4,
          "name": "Critical Fix",
          "description": "When you take the Patch action, when you would roll to restore hull points, you can take the maximum instead of rolling. You can use this feature before or after making the roll. Once you’ve used this feature, you must complete a short or long rest before you can use it again."
        },
        {
          "rank": 5,
          "name": "Last Line of Defense",
          "description": "As a reaction, when your ship would otherwise be reduced to zero hull points, you can instead reduce your hull points to one. Once you’ve used this feature, you must finish a long rest before you can use it again."
        }
      ]
    },
    "quartermaster": {
      "feats": [
        {
          "rank": 1,
          "name": "Streamlined Operation",
          "description": "When another crew member uses a ship deployment feature, you can use your reaction to reduce its resource cost (such as a command die or hull die) by 1. You can use this feature a number of times equal to your ranks in Quartermaster. You regain all expended uses when you complete a long rest."
        },
        {
          "rank": 2,
          "name": "Emergency Supplies",
          "description": "As an action, you can allocate resources from your emergency reserves. Restore a number of spent uses of Command Dice, Hull Dice, or other limited ship resources (such as specialty ammunition) equal to your ranks in Quartermaster plus your Wisdom modifier. You decide which resources are replenished. Once you use this feature, you cannot use it again until you finish a long rest."
        },
        {
          "rank": 3,
          "name": "Tactical Assistance",
          "description": "As a bonus action, you can grant one crew member tactical assistance. The chosen creature can add a bonus equal to your Intelligence modifier to one ability check or attack roll it makes within the next minute. You can use this feature a number of times equal to your ranks in Quartermaster. You regain all expended uses when you complete a short or long rest."
        },
        {
          "rank": 4,
          "name": "Quick Calculations",
          "description": "When your ship takes damage, you can use your reaction to expend one command die to mitigate some of the damage taken. Roll the command die and reduce the damage taken by an amount equal to the roll plus your Intelligence modifier. Additionally, once per long rest, you can take the Patch action as a bonus action instead of an action."
        },
        {
          "rank": 5,
          "name": "Master Logistician",
          "description": "As an action, you can direct your crew to optimize their tasks. Until the end of your next turn, all crew members (including yourself) can add your Intelligence modifier to their attack rolls, ability checks, or saving throws. You can use this feature once per short or long rest."
        }
      ]
    },
    "masterGunner": {
      "feats": [
        {
          "rank": 1,
          "name": "Munitions Expert",
          "description": "As a bonus action, you may choose one of the following forms of cannon ammunition to add an additional effect to your next attack: Chain Shot, Smoke Shells, Inferno Shells, Armor Piercing Rounds"
        },
        {
          "rank": 2,
          "name": "Quick Reload",
          "description": "As a bonus action, you can expend one command die to immediately reload a number of ship weapons equal to the amount rolled on the command die. You may use this feature a number of times equal to your ranks in Master Gunner. You regain all expended uses when you complete a long rest."
        },
        {
          "rank": 3,
          "name": "Adjust Fire",
          "description": "When you roll for damage with a ship weapon, you can reroll one of the dice, but you must use the new result. You may use this feature a number of times equal to your ranks in Master Gunner. You regain all expended uses when you complete a long rest."
        },
        {
          "rank": 4,
          "name": "Deadeye Gunner",
          "description": "Ships weapons score a critical hit on a roll of 19 or 20. Additionally, you can roll the weapon damage dice one additional time when determining the extra damage for a critical hit with a ship weapon."
        },
        {
          "rank": 5,
          "name": "Master Artillerist",
          "description": "When you hit a target with a ship attack, you can deal maximum damage with that attack. Once you’ve used this feature, you can’t use it again until you finish a short or long rest."
        }
      ]
    },
    "lookout": {
      "feats": [
        {
          "rank": 1,
          "name": "Scan the Horizon",
          "description": "While positioned in one of the ship's crow's nests and making a Wisdom (Perception) check to identify a ship or creature, you may do so with advantage."
        },
        {
          "rank": 2,
          "name": "Find Vulnerability",
          "description": "As a bonus action, you can make an Intelligence (Investigation) check to identify a target's weak spot. Until your next turn, your ship has advantage on all weapon attacks against the target. You may use this feature a number of times equal to your ranks in Lookout. You regain all expended uses when you complete a long rest."
        },
        {
          "rank": 3,
          "name": "Threat Assessment",
          "description": "As a bonus action, you can learn certain information about the capabilities of your target. The DM tells you if the ship is your ship’s equal, superior, or inferior in regard to two of the following characteristics of your choice: An ability score, armor class, current total hull points, number of crew, or speed (water)"
        },
        {
          "rank": 4,
          "name": "Weather Eye",
          "description": "Once per long rest, you can spend one minute studying the horizon and use this feature to gain a forecast of the weather for the next hour. This forecast includes precise details about wind direction and speed, wave conditions, and any imminent storms or environmental hazards that could affect your ship’s journey."
        },
        {
          "rank": 5,
          "name": "Bird's Eye View",
          "description": "As an action, you can survey the battlefield and direct your ship’s crew to optimize their actions. Until the end of your next turn, all weapon attacks made by your ship and its crew ignore half cover and three-quarters cover, and the range of all weapon attacks increases by 50%. Additionally, if your ship has advantage on attack rolls, you can choose to reroll one attack roll if it misses. Once you use this feature, you can’t use it again until you finish a short or long rest."
        }
      ]
    },
    "captain": {
      "feats": [
        {
          "rank": 1,
          "name": "Command Authority",
          "description": "Placeholder description for Command Authority."
        },
        {
          "rank": 2,
          "name": "Tactical Maneuver",
          "description": "Placeholder description for Tactical Maneuver."
        },
        {
          "rank": 3,
          "name": "Inspire Crew",
          "description": "Placeholder description for Inspire Crew."
        },
        {
          "rank": 4,
          "name": "Fearless Leadership",
          "description": "Placeholder description for Fearless Leadership."
        },
        {
          "rank": 5,
          "name": "Ultimate Command",
          "description": "Placeholder description for Ultimate Command."
        }
      ]
    },
    "personnelOfficer": {
      "feats": [
        {
          "rank": 1,
          "name": "Efficient Recruitment",
          "description": "Placeholder description for Efficient Recruitment."
        },
        {
          "rank": 2,
          "name": "Crew Morale Boost",
          "description": "Placeholder description for Crew Morale Boost."
        },
        {
          "rank": 3,
          "name": "Conflict Resolution",
          "description": "Placeholder description for Conflict Resolution."
        },
        {
          "rank": 4,
          "name": "Advanced Training",
          "description": "Placeholder description for Advanced Training."
        },
        {
          "rank": 5,
          "name": "Master Strategist",
          "description": "Placeholder description for Master Strategist."
        }
      ]
    }
  }
}